Repository: nadenislamarre/grooms
Catalog: system/LC_MESSAGES/*/grooms.po
Languages: fr

source: Last updated rooms
fr: Derniers salons mis à jour

source: Create your own room
fr: Créer votre propre salon

source: Room name:
fr: Nom du salon:

source: Password:
fr: Mot de passe:

source: Create
fr: Créer

source: %1 day
fr: %1 jour

source: %1 hour
fr: %1 heure

source: %1 day ago
fr: il y a %1 jour

source: %1 hour ago
fr: il y a %1 heure

source: %1 minute ago
fr: il y a %1 minute

source: %1, %2 ago
fr: il y a %1 et %2

source: %1, %2, %3 ago
fr: il y a %1, %2 et %3

source: Project
fr: Projet

source: Grooms (Go Rooms) is a <a href="system/COPYING">GPL</a> project to allow you to play the go game over internet with your friends in a simple way in real time or over severals days with your computer, your phone or your tablet.
fr: Grooms (Go Rooms) est un projet <a href="system/COPYING">GPL</a> qui vous permet de jouer au jeu de go sur internet avec vos amis de manière simple en temps réel ou différé sur plusieurs jours sur ordinateur, téléphone ou tablette.

source: Features
fr: Fonctionnalités

source: Web game (no software to install)
fr: Jeu sur internet (pas d'installation requise)

source: Computers, phones, tablets compatible
fr: Compatible ordinateurs, téléphones et tablettes

source: Real time or over several days games
fr: Jeu temps réél ou sur plusieurs jours

source: Rss feed (alerts when it's your turn to play)
fr: Flux rss (alertes lorsque c'est votre tour de jouer)

source: Watch other people playing
fr: Regarder les autres jouer

source: Comments of serevals people
fr: Plusieurs commentateurs possibles

source: Simulation mode
fr: Mode simulation

source: Old games consultation
fr: Anciennes parties gardées en ligne

source: Grooms website
fr: Site web Grooms

source: Browse sources
fr: Voir les sources

source: Graphics are under <a href="http://fr.wikipedia.org/wiki/Licence_Creative_Commons">Creative Commons Licence</a> and come from the <a href="http://jgoboard.com">jGoBoard</a> project.
fr: Les graphismes sont sous <a href="http://fr.wikipedia.org/wiki/Licence_Creative_Commons">Licence Creative Commons</a> et viennent du projet <a href="http://jgoboard.com">jGoBoard</a>.

source: For any question, remark or contribution : <u>nicolas dot adenis dot lamarre at gmail dot com</u>
fr: Pour toute question, remarque ou contribution : <u>nicolas point adenis point lamarre arobase gmail point com</u>

source: Error :
fr: Erreur :

source: Password confirmation mismatches
fr: Les mots de passe ne correspondent pas

source: Join the room at <a href="%1">%2</a>
fr: Rejoindre le salon sur <a href="%1">%2</a>

source: Room already exists
fr: Un salon du même nom existe déjà

source: Unable to create the room (mkdir failed)
fr: Impossible de créer le salon (mkdir a échoué)

source: Unable to create the room (config files creation failed)
fr: Impossible de créer le salon (la création des fichiers de configuration a échoué)

source: Invalid room (empty name)
fr: Salon invalide (pas de nom)

source: Invalid room (unauthorized name)
fr: Salon invalide (nom non autorisé)

source: Invalid room (unexisting room)
fr: Salon invalide (inexistant)

source: Invalid room (invalid characters found (A-Z a-z 0-9 allowed only))
fr: Salon invalide (nom avec des caractères invalides (seuls A-Z a-z 0-9 sont autorisés))

source: Invalid room (length > 16)
fr: Salon invalide (longeur supérieur à 16 caractères)

source: more
fr: plus

source: less
fr: moins

source: Grooms FAQ
fr: FAQ Grooms

source: How do I cancel a move ?
fr: Comment annuler un coup ?

source: Clic on the last played stone to cancel it.
fr: Cliquez sur le dernier coup joué pour l'annuler.

source: When I clic on 'Count points', dead stones are not marked. How does it work ?
fr: Quand je clique sur 'Compter les points', les pierres mortes ne sont pas affichées. Comment faire ?

source: Determine the living/dead stones to count points is not always possible. When you clic on 'Count points' you have to clic on dead stones groups to mark them as dead otherwise, they are considered as living. If you clic on a dead group, it becomes living again.
fr: Déterminer les pierres vivantes et mortes dans une partie de go n'est pas toujours possible. Quand vous cliquez sur 'Compter les points', vous devez cliquer sur les pierres mortes pour les marquer, sinon, elles seront considérées comme vivantes. Si vous cliquez sur des pierres mortes, elles redeviendront vivantes.

source: How can I be alerted when it's my turn to play ?
fr: Comment être averti que c'est à mon tour de jouer ?

source: In the directory http://&lt;server&gt;/&lt;room name&gt;/rss, you can find 3 files. go.rss is updated at each turn. go_black.rss is updated when something is interesting for blacks. go_white.rss is updated when something is interesing for whites. Rss softwares check these files regularly and inform you when something happend. For example, if you install "My News Alerts" on your Android phone and ask it to check for the file go_black.rss of your room, your phone will ring each time it's black's turn.
fr: Dans le répertoire http://&lt;serveur&gt;/&lt;nom du salon&gt;/rss, il y a 3 fichiers. go.rss est mis à jour à chaque coup. go_black.rss est mis à jour lorsqu'il y a quelque chose à faire pour les noirs. go_white.rss est mis à jour lorsqu'il y a quelque chose à faire pour les blancs. Il existe des applications Rss qui vérifient régulièrement ces fichiers pour vous informer lorsqu'il y a quelque chose de nouveau. Par exemple, si vous installez l'application "My News Alerts" sur votre téléphone Android et lui demandez de surveiller le fichier go_black.rss, votre téléphone sonnera à chaque fois que c'est aux noirs à jouer.

source: How do I create my own Grooms server ?
fr: Comment créer son serveur Grooms ?

source: Prerequisites are just apache+php. Download the grooms zip file, and unzip it anywhere you apache server is configured for. The link http://&lt;server&gt;/system/check.php?room=&lt;room name&gt; can help you to fix some permission issues. You should configure apache to prevent .db files to be downloaded (the .htaccess delivered will do that automatically while it's configured to be used on most provider systems)
fr: Les prérequis sont juste apache+php. Téléchargez le fichier zip grooms et dépackagez sur votre serveur apache. Le lien http://&lt;serveur&gt;/system/check.php?room=&lt;salon name&gt; peut vous aider à régler les problèmes de permissions. Vous devriez également configurer apache pour interdire le téléchargement de fichier .db (le fichier .htaccess devrait le faire automatiquement car c'est déjà configuré ainsi chez la plupart des hébergeurs)

source: How do I translate the game ?
fr: Comment traduire le jeu ?

source: Just fill the file <a href="LC_MESSAGES/grooms.pot">grooms.pot</a> and send it by email to nicolas dot adenis dot lamarre at gmail dot com. You can take examples on <a href="LC_MESSAGES/fr/grooms.po">the french grooms.po file</a>. If you have any question to fill this file, don't hesitate to email too.
fr: Il suffit de remplir le fichier <a href="LC_MESSAGES/grooms.pot">grooms.pot</a> et de l'envoyer par email à nicolas point adenis point lamarre arobase gmail point com. Vous pouvez prendre exemple sur <a href="LC_MESSAGES/fr/grooms.po">le fichier de traduction française grooms.po</a>. Si vous avez une question pour remplir ce fichier, n'hésitez pas également à envoyer un email.

source: Unable to load history
fr: Impossible de charger l'historique

source: Password confirmation mismatches. Password not saved.
fr: Les mots de passe ne correspondent pas. Le mot de passe n'a pas été changé.

source: Configuration saved.
fr: Configuration enregistrée.

source: Unable to save the configuration.
fr: Impossible d'enregistrer la configuration.

source: fopen failed
fr: fopen a échoué

source: fwrite failed
fr: fwrite a échoué

source: fclose failed
fr: fclose a échoué

source: Show times in history for unconnected people
fr: Afficher les dates dans l'historique pour les visiteurs non connectés

source: Show comments for unconnected people
fr: Afficher les commentaires pour les visiteurs non connectés

source: Keep password empty to not update it.
fr: Laissez les mots de passe vide pour ne pas les mettre à jour.

source: Save
fr: Enregistrer

source: Please fill your name
fr: Veuillez remplir votre nom

source: Please fill a comment
fr: Veuillez remplir un commentaire

source: Comment
fr: Commentaire

source: Hide commenting
fr: Cacher les champs de commentaire

source: loading...
fr: chargement...

source: Connexion failed
fr: La connexion a échoué

source: Pass your turn
fr: Passez votre tour

source: Cancel pass
fr: Annuler passer

source: Simulate
fr: Simuler

source: Reset the simulation
fr: Reinitialiser la simulation

source: Stop the simulation
fr: Arrêter la simulation

source: Logout
fr: Déconnexion

source: Count points
fr: Compter les points

source: Back to the game
fr: Retour au jeu

source: Reset counting
fr: Réinitialiser

source: Current game
fr: Partie en cours

source: Reset game
fr: Nouvelle partie

source: Hide game resetting
fr: Cacher les champs de nouvelle partie

source: Old games
fr: Anciennes parties

source: Hide old games
fr: Cacher les champs anciennes parties

source: Your name :
fr: Votre nom :

source: Visible comment
fr: Commentaire visible

source: Hidden comment
fr: Commentaire caché

source: Send this comment
fr: Envoyer le commentaire

source: Size :
fr: Taille :

source: Game :
fr: Partie :

source: Load
fr: Charger

source: Pass
fr: Passe

source: Territories
fr: Territoires

source: Living stones
fr: Pierres vivantes

source: Dead Stones
fr: Pierres mortes

source: Prisoners
fr: Prisonniers

source: Japanese rules
fr: Règles japonaises

source: Chinese rules
fr: Règles chinoises

source: for this action
fr: pour cette action

source: %1 action ago
fr: il y a %1 action

source: Black's turn
fr: Aux noirs

source: White's turn
fr: Aux blancs

source: Prisoners :
fr: Prisonniers :

source: Black
fr: Noirs

source: White
fr: Blancs

source: Stone %1
fr: Pierre %1

source: Help
fr: Aide

source: Login
fr: Connexion

source: Invalid password
fr: Mot de passe incorrect

source: Unable to create the rss directory
fr: Impossible de créer le répertoire rss

source: Unable to create backup directory
fr: Impossible de créer le répertoire de sauvegarde

source: Unable to backup file
fr: Impossible de sauvegarder le fichier

source: Unable to remove the file
fr: Impossible de supprimer le fichier

source: Unable to open database file
fr: Impossible d'ouvrir le fichier de données

source: Invalid file
fr: Fichier invalide

source: FAILED
fr: ECHEC

source: Check
fr: Vérification

source: Status
fr: Statut

source: game directory is writable
fr: répertoire de jeu accessible en écriture

source: db_path is writable
fr: db_path accessible en écriture

source: dbcount_path is writable
fr: dbcount_path accessible en écriture

source: backup directory is writable
fr: répertoire de sauvegarde accessible en écriture

source: shared network file system status
fr: statut du partage nfs

source: shared network file system lock key
fr: clef de lock du partage nfs

source: enabled
fr: activé

source: disabled
fr: désactivé
